Vulintus/Vulintus_Board_Definitions/hardware/samd/0.2.0/boards.txt
vpb_ring_light.name=VPB Ring Light (PB-RL)

# VID/PID for Bootloader, Arduino & CircuitPython
# Microchip's VID (https://www.microchip.com/usblicensing/)
# Sublicense Request 4290, submitted by Drew on 1/13/2022
vpb_ring_light.vid.0=0x04D8    
vpb_ring_light.pid.0=0xE6C0    
vpb_ring_light.build.vid=0x04D8
vpb_ring_light.build.pid=0xE6C0

# Upload
vpb_ring_light.upload.erase=
vpb_ring_light.upload.maximum_data_size=4096
vpb_ring_light.upload.maximum_size=12288
vpb_ring_light.upload.native_usb=true
vpb_ring_light.upload.offset=0x1000
vpb_ring_light.upload.protocol=sam-ba
vpb_ring_light.upload.tool=bossac19
vpb_ring_light.upload.use_1200bps_touch=true
vpb_ring_light.upload.wait_for_upload_port=true

# Build
vpb_ring_light.build.board=RING_LIGHT_V2_0
vpb_ring_light.build.cache_flags=-DENABLE_CACHE
vpb_ring_light.build.core=Fab_SAM_Arduino:arduino
vpb_ring_light.build.extra_flags=-D__SAMD11__ -D__SAMD11C14A__ -DVULINTUS_RING_LIGHT -DCRYSTALLESS -DARM_MATH_CM0PLUS {build.usb_flags}
vpb_ring_light.build.f_cpu=48000000L
vpb_ring_light.build.flags.optimize=-Os
vpb_ring_light.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
vpb_ring_light.build.mcu=cortex-m0plus
# MOVED TO MENU: vpb_ring_light.build.openocdscript=openocd_scripts/ring_light_v2_0.cfg
# MOVED TO MENU: vpb_ring_light.build.usb_product="Ring Light V2.0"
vpb_ring_light.build.usb_manufacturer="Vulintus"
# MOVED TO MENU: vpb_ring_light.build.variant=ring_light_v2_0
vpb_ring_light.build.variant_system_lib=

# Bootloader
vpb_ring_light.bootloader.tool=openocd
vpb_ring_light.bootloader.file=ring_light_v2_0/sam_ba_SAMD11C14A.bin

# Menu
vpb_ring_light.menu.pcb_ver.v2_0=Version 2.0
vpb_ring_light.menu.pcb_ver.v2_0.build.variant=ring_light_v2_0
vpb_ring_light.menu.pcb_ver.v2_0.build.openocdscript=openocd_scripts/ring_light_v2_0.cfg
vpb_ring_light.menu.pcb_ver.v2_0.build.usb_product="VPB Ring Light V2.0"


########################################################################################################################
# VPB Ring Light (PB-RL) - FabSam Workaround
# ---------------------------------------

vpb_ring_light_fab_sam.name=VPB Ring Light (PB-RL) - FabSam Workaround

# VID/PID for Bootloader, Arduino & CircuitPython
# Microchip's VID (https://www.microchip.com/usblicensing/)
# Sublicense Request 4290, submitted by Drew on 1/13/2022
vpb_ring_light_fab_sam.vid.0=0x04D8    
vpb_ring_light_fab_sam.pid.0=0xE6C0    
vpb_ring_light_fab_sam.build.vid=0x04D8
vpb_ring_light_fab_sam.build.pid=0xE6C0

# Upload (with Bootloader)
vpb_ring_light_fab_sam.upload.erase=
vpb_ring_light_fab_sam.upload.maximum_data_size=4096
vpb_ring_light_fab_sam.upload.maximum_size=12288
vpb_ring_light_fab_sam.upload.offset=0x1000
vpb_ring_light_fab_sam.upload.native_usb=true
vpb_ring_light_fab_sam.upload.protocol=sam-ba
vpb_ring_light_fab_sam.upload.tool=Fab_SAM_Arduino:bossac
vpb_ring_light_fab_sam.upload.use_1200bps_touch=true
vpb_ring_light_fab_sam.upload.wait_for_upload_port=true

# Build
# vpb_ring_light_fab_sam.build.board=RING_LIGHT
vpb_ring_light_fab_sam.build.board=SAMD_ZERO
vpb_ring_light_fab_sam.build.bootloader_size=__4KB_BOOTLOADER__
vpb_ring_light_fab_sam.build.buildconfig=CONFIG_H_DISABLED
vpb_ring_light_fab_sam.build.cache_flags=-DENABLE_CACHE
vpb_ring_light_fab_sam.build.chip=samd11
vpb_ring_light_fab_sam.build.clockconfig=CLOCKCONFIG_INTERNAL_USB
vpb_ring_light_fab_sam.build.core=fab_sam
vpb_ring_light_fab_sam.build.extra_flags=-D__SAMD11C14A__ -DVULINTUS_RING_LIGHT {build.usb_flags} -DARM_MATH_CM0PLUS
vpb_ring_light_fab_sam.build.f_cpu=48000000L
vpb_ring_light_fab_sam.build.floatconfig=FLOAT_BOTH_DOUBLES_ONLY
vpb_ring_light_fab_sam.build.ldscript=linker_scripts/gcc/4KB_Bootloader/flash_16KB.ld
vpb_ring_light_fab_sam.build.mathlib=arm_cortexM0l_math
vpb_ring_light_fab_sam.build.mcu=cortex-m0plus
# MOVED TO MENU: vpb_ring_light_fab_sam.build.openocdscript=openocd_scripts/ring_light_v2_0_fab_sam.cfg
vpb_ring_light_fab_sam.build.flags.optimize=-Os
vpb_ring_light_fab_sam.build.serialcom_uart=NO_UART
vpb_ring_light_fab_sam.build.serialcom_wire=NO_WIRE
vpb_ring_light_fab_sam.build.serialcom_spi=NO_SPI
vpb_ring_light_fab_sam.build.timerconfig=TIMER_732Hz
# MOVED TO MENU: vpb_ring_light_fab_sam.build.usb_product="Ring Light V2.0"
vpb_ring_light_fab_sam.build.usb_manufacturer="Vulintus"
vpb_ring_light_fab_sam.build.usbcom=CDC_ONLY
# MOVED TO MENU: vpb_ring_light_fab_sam.build.variant=ring_light_v2_0_fab_sam
vpb_ring_light_fab_sam.build.variant_system_lib=

# Bootloader
vpb_ring_light_fab_sam.bootloader.file=ring_light_v2_0_fab_sam/sam_ba_SAMD11C14A.bin
vpb_ring_light_fab_sam.bootloader.tool=edbg

# Compiler
vpb_ring_light_fab_sam.compiler.c.extra_flags="-I{runtime.tools.CMSIS-4.5.0.path}/CMSIS/Include/" "-I{runtime.tools.CMSIS-Atmel-1.0.0-mattairtech-2.path}/CMSIS/Device/ATMEL/" -D{build.floatconfig} -D{build.timerconfig} -D{build.buildconfig} -D{build.clockconfig} -D{build.usbcom} -D{build.serialcom_uart} -D{build.serialcom_wire} -D{build.serialcom_spi} -D{build.bootloader_size}
vpb_ring_light_fab_sam.compiler.cpp.extra_flags="-I{runtime.tools.CMSIS-4.5.0.path}/CMSIS/Include/" "-I{runtime.tools.CMSIS-Atmel-1.0.0-mattairtech-2.path}/CMSIS/Device/ATMEL/" -D{build.floatconfig} -D{build.timerconfig} -D{build.buildconfig} -D{build.clockconfig} -D{build.usbcom} -D{build.serialcom_uart} -D{build.serialcom_wire} -D{build.serialcom_spi} -D{build.bootloader_size}
vpb_ring_light_fab_sam.compiler.S.extra_flags="-I{runtime.tools.CMSIS-4.5.0.path}/CMSIS/Include/" "-I{runtime.tools.CMSIS-Atmel-1.0.0-mattairtech-2.path}/CMSIS/Device/ATMEL/" -D{build.floatconfig} -D{build.timerconfig} -D{build.buildconfig} -D{build.clockconfig} -D{build.usbcom} -D{build.serialcom_uart} -D{build.serialcom_wire} -D{build.serialcom_spi} -D{build.bootloader_size}

# Menu
vpb_ring_light_fab_sam.menu.pcb_ver.v2_0=Version 2.0
vpb_ring_light_fab_sam.menu.pcb_ver.v2_0.build.variant=ring_light_v2_0_fab_sam
vpb_ring_light_fab_sam.menu.pcb_ver.v2_0.build.openocdscript=openocd_scripts/ring_light_v2_0_fab_sam.cfg
vpb_ring_light_fab_sam.menu.pcb_ver.v2_0.build.usb_product="VPB Ring Light V2.0"

########################################################################################################################